In [1]:
import pandas as pd

In [2]:
# Pndas support all kinds of file reading
df = pd.read_csv("sales.csv", delimiter=",")

In [3]:
df

,CustomerID,FirstName,LastName,Country,Gender,Age,TotalPurchase,LastPurchaseDate,Quantity,Sales,Order Group
0,1,James,Okoro,Nigeria,Male,32,420.50,2025-10-15,3,1261.50,Multiple Order
1,2,Ada,Umeh,Ghana,Female,27,380.00,2025-09-23,4,1520.00,Multiple Order
2,3,John,Doe,Kenya,Male,41,1020.75,2025-11-01,1,1020.75,Single Quantity
3,4,Mary,Adeyemi,Nigeria,Female,35,650.20,2025-10-28,5,3251.00,Multiple Order
4,5,Samuel,Mutiso,Kenya,Male,29,295.40,2025-08-11,6,1772.40,Multiple Order

In [4]:
## Data Inspection
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   CustomerID        5 non-null      int64
 1   FirstName         5 non-null      object
 2   LastName          5 non-null      object
 3   Country           5 non-null      object
 4   Gender            5 non-null      object
 5   Age               5 non-null      int64
 6   TotalPurchase     5 non-null      float64
 7   LastPurchaseDate  5 non-null      object
 8   Quantity          5 non-null      int64
 9   Sales             5 non-null      float64
 10  Order Group       5 non-null      object
dtypes: float64(2), int64(3), object(6)
memory usage: 572.0+ bytes

In [5]:
df.shape

(5, 11)

In [6]:
df.describe() # Numerical Columns

       CustomerID        Age  TotalPurchase  Quantity        Sales
count    5.000000   5.000000       5.000000  5.000000     5.000000
mean     3.000000  32.800000     553.370000  3.800000  1765.130000
std      1.581139   5.495453     292.438125  1.923538   876.883115
min      1.000000  27.000000     295.400000  1.000000  1020.750000
25%      2.000000  29.000000     380.000000  3.000000  1261.500000
50%      3.000000  32.000000     420.500000  4.000000  1520.000000
75%      4.000000  35.000000     650.200000  5.000000  1772.400000
max      5.000000  41.000000    1020.750000  6.000000  3251.000000

In [7]:
df['CustomerID']

0    1
1    2
2    3
3    4
4    5
Name: CustomerID, dtype: int64

In [8]:
df[['Age', 'TotalPurchase']].describe()

             Age  TotalPurchase
count   5.000000       5.000000
mean   32.800000     553.370000
std     5.495453     292.438125
min    27.000000     295.400000
25%    29.000000     380.000000
50%    32.000000     420.500000
75%    35.000000     650.200000
max    41.000000    1020.750000

In [9]:
df.describe(include="object")

       FirstName LastName  Country Gender LastPurchaseDate     Order Group
count          5        5        5      5                5               5
unique         5        5        3      2                5               2
top        James    Okoro  Nigeria   Male       2025-10-15  Multiple Order
freq           1        1        2      3                1               4

In [10]:
import pandas as pd

In [11]:
df = pd.read_csv("sales.csv")

In [12]:
df

,CustomerID,FirstName,LastName,Country,Gender,Age,TotalPurchase,LastPurchaseDate,Quantity,Sales,Order Group
0,1,James,Okoro,Nigeria,Male,32,420.50,2025-10-15,3,1261.50,Multiple Order
1,2,Ada,Umeh,Ghana,Female,27,380.00,2025-09-23,4,1520.00,Multiple Order
2,3,John,Doe,Kenya,Male,41,1020.75,2025-11-01,1,1020.75,Single Quantity
3,4,Mary,Adeyemi,Nigeria,Female,35,650.20,2025-10-28,5,3251.00,Multiple Order
4,5,Samuel,Mutiso,Kenya,Male,29,295.40,2025-08-11,6,1772.40,Multiple Order

In [13]:
sales = pd.read_csv("sales.csv")

In [14]:
sales

,CustomerID,FirstName,LastName,Country,Gender,Age,TotalPurchase,LastPurchaseDate,Quantity,Sales,Order Group
0,1,James,Okoro,Nigeria,Male,32,420.50,2025-10-15,3,1261.50,Multiple Order
1,2,Ada,Umeh,Ghana,Female,27,380.00,2025-09-23,4,1520.00,Multiple Order
2,3,John,Doe,Kenya,Male,41,1020.75,2025-11-01,1,1020.75,Single Quantity
3,4,Mary,Adeyemi,Nigeria,Female,35,650.20,2025-10-28,5,3251.00,Multiple Order
4,5,Samuel,Mutiso,Kenya,Male,29,295.40,2025-08-11,6,1772.40,Multiple Order